pyzmq-workshop/pyzmq-workshop.org
#+AUTHOR: Ignasi Fosch
#+TITLE: PyBCN October Dojo: Pyzmq workshop
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_HLEVEL: 1
#+REVEAL_EXTRA_CSS: ./dojos.css
#+OPTIONS: toc:1
#+OPTIONS: reveal_progress:t
#+OPTIONS: reveal_title_slide:"<h1>%t</h1><h2>%a</h2>"
#+OPTIONS: reveal_width:1200
#+OPTIONS: reveal_height:800
#+REVEAL_THEME: blood
#+REVEAL_PLUGINS: (notes)

* About this Dojo session
** About me
   - Sysadmin, not a developer
   - I do quite a lot of code, but for tooling, operations, and orchestration
   - Don't take me very seriously

** This is not a Dojo, sorry
   - It is more a workshop
   - Specific about 0mq, and more concretely, pyzmq

** PyBCN Dojos goals still valid
   - Have fun coding with friends
   - Learn about techniques and tools from others
   - Share knowledge with others
   - Practice new techniques and tools in a safe environment

** In memoriam Pieter Hintjens
   - Pieter Hintjens, creator of 0mq, died two years ago, October 4th 2016
   - Belgian software developer, author and past president of FFII, fighter against software patents
   - Author of AMQP, founder of Digital Standards Organization, and editor of the RestMS
   - This session is very loosely based on a surprise workshop he gave at EuroPython 2014 Berlin

* Basic 0mq
** What it is, and what it is not?
   - Library, not a system or a server
   - Asynchronous
   - Message queues, providing API for message exchange between processes
   - High performant

** What it is for?
   - Building distributed or concurrent applications or systems
   - Provide message queues
   - Client-server and P2P models
   - Communicate system components built in different languages
   - Why not...
     + Traditional sockets?
     + HTTP APIs?
   - Socket reusage and the 4th layer

** How to get it installed?
   - Standard install
   #+BEGIN_EXAMPLE
     pip install pyzmq
   #+END_EXAMPLE

   - Cool version:
   #+BEGIN_SRC bash :export code
     pipenv install pyzmq
   #+END_SRC

** How does it look like?
   - Resembling Berkeley sockets
   - Hello World server
   #+BEGIN_SRC python :exports code :tangle helloworld_server.py
     import time
     import zmq

     context = zmq.Context()
     server = context.socket(zmq.REP)
     server.bind('tcp://*:5555')

     while True:
         message = server.recv().decode()
         print('Received request: {}'.format(message))
         time.sleep(1)
         server.send(b'World')
   #+END_SRC

#+REVEAL: split

   - Hello World client
   #+BEGIN_SRC python :exports code :tangle helloworld_client.py
     import time
     import zmq

     context = zmq.Context()
     socket = context.socket(zmq.REQ)
     socket.connect("tcp://localhost:5555")

     for request in range(10):
         print('Sending request {}...'.format(request))
         socket.send(b'Hello')
         response = socket.recv().decode()
         print('Received reply {}: {}'.format(request, response))
   #+END_SRC
   
* First exercise: Guessing the city
** Description
   - Two processes: Hider and seeker
   - Hider chooses a random city from a list in a file, and listens for messages with a city name each. It replies 'CORRECT' or 'INCORRECT', depending on the match. If there's a match, chooses another city
   - Seeker connects to a specific local port, chooses a city, or accepts one as argument, and issues its guess. It will repeat, until it's guessed
     
** Hider

#+BEGIN_SRC python :exports code :tangle hider.py
  import random
  import zmq

  cities = open('cities.txt').readlines()
  city = random.choice(cities).strip()
  print('[HIDER] City chosen is {}'.format(city))

  context = zmq.Context()
  server = context.socket(zmq.REP)
  server.bind('tcp://*:5555')

  while True:
      message = server.recv().decode()
      print('[HIDER] Received request: {}'.format(message))
      print('[HIDER] Current city: {}'.format(city))
      reply = 'INCORRECT'
      if message == city:
          reply = 'CORRECT'
          city = random.choice(cities).strip()
          print('[HIDER] City chosen is {}'.format(city))
      server.send(str.encode(reply))
#+END_SRC

