pyzmq-workshop/pyzmq-workshop.org
** Seeker

#+BEGIN_SRC python :exports code :tangle seeker.py
  import random
  import sys
  import zmq

  cities = open('cities.txt').readlines()

  context = zmq.Context()
  socket = context.socket(zmq.REQ)
  socket.connect('tcp://localhost:5555')

  response = ''
  while response != 'CORRECT':
      city = random.choice(cities).strip()
      print('[SEEKER] Guessed city is {}'.format(city))
      socket.send(str.encode(city))
      response = socket.recv().decode()
      print('[SEEKER] Received reply {}: {}'.format(city, response))
#+END_SRC

* More depth
** Serialization: Many faces
  - ~send~ and ~recv~ have corresponding ~send_string~ and ~recv_string~
  - There are others, like ~send_json~, or ~send_pyobj~, with corresponding ~recv_json~ and ~recv_pyobj~
  - Serializing functions can be used for customization

** Pub Sub
  - Publisher sending updates to many Subscribers
  - Updates categorized
  - Subscriber can opt on specific updates
  - Publisher
  #+BEGIN_SRC python :exports code :tangle pub.py
     import zmq
     import time
     import sys

     port = "5556"
     if len(sys.argv) > 1:
         port =  sys.argv[1]
         int(port)

     context = zmq.Context()
     socket = context.socket(zmq.PUB)
     socket.bind("tcp://*:%s" % port)
     topic = 0
     while True:
         topic, now = topic + 1, time.ctime()
         socket.send_string("1 update {} {}".format(topic, now))
         socket.send_string("2 update {} {}".format(topic, now))
         time.sleep(1)
   #+END_SRC

#+REVEAL: split

   - Subscriber
   #+BEGIN_SRC python :exports code :tangle sub.py
     import sys
     import zmq

     context = zmq.Context()
     sock = context.socket(zmq.SUB)

     topic = "1"
     if len(sys.argv) > 1:
         topic = sys.argv[1]
     sock.setsockopt_string(zmq.SUBSCRIBE, topic)
     sock.connect("tcp://127.0.0.1:5556")

     while True:
         message = sock.recv_string()
         print(message)
   #+END_SRC

* Second exercise: Getting temperature
** Description
   - Build a temperature server publishing zip codes (9999 to 10005), with temperatures
   - Then add a subscriber subscribing to a zip code, and calculating the average temperature for the last 5 records
   - Try to make the client capable to connect to more than one server

** Weather server
   #+BEGIN_SRC python :exports code :tangle weather_server.py
     import zmq
     import random
     import sys
     import time

     port = "5556"
     if len(sys.argv) > 1:
         port =  sys.argv[1]
         int(port)

     context = zmq.Context()
     socket = context.socket(zmq.PUB)
     socket.bind("tcp://*:%s" % port)
     while True:
         topic = random.randrange(9999,10005)
         messagedata = random.randrange(1,215) - 80
         socket.send_string("%d %d" % (topic, messagedata))
         print("%d %d" % (topic, messagedata))
         time.sleep(1)
   #+END_SRC
   
