pyzmq-workshop/pyzmq-workshop.html
<section id="slide-org770a5c6">
<h3 id="org770a5c6"><span class="section-number-3">3.3</span> Seeker</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">import</span> random
<span style="color: #F92672;">import</span> sys
<span style="color: #F92672;">import</span> zmq

<span style="color: #FD971F;">cities</span> = <span style="color: #F92672;">open</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'cities.txt'</span><span style="color: #AE81FF;">)</span>.readlines<span style="color: #AE81FF;">()</span>

<span style="color: #FD971F;">context</span> = zmq.Context<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">socket</span> = context.socket<span style="color: #AE81FF;">(</span>zmq.REQ<span style="color: #AE81FF;">)</span>
socket.connect<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'tcp://localhost:5555'</span><span style="color: #AE81FF;">)</span>

<span style="color: #FD971F;">response</span> = <span style="color: #E6DB74;">''</span>
<span style="color: #F92672;">while</span> response != <span style="color: #E6DB74;">'CORRECT'</span>:
    <span style="color: #FD971F;">city</span> = random.choice<span style="color: #AE81FF;">(</span>cities<span style="color: #AE81FF;">)</span>.strip<span style="color: #AE81FF;">()</span>
    <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'[SEEKER] Guessed city is {}'</span>.<span style="color: #F92672;">format</span><span style="color: #66D9EF;">(</span>city<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
    socket.send<span style="color: #AE81FF;">(</span><span style="color: #F92672;">str</span>.encode<span style="color: #66D9EF;">(</span>city<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
    <span style="color: #FD971F;">response</span> = socket.recv<span style="color: #AE81FF;">()</span>.decode<span style="color: #AE81FF;">()</span>
    <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'[SEEKER] Received reply {}: {}'</span>.<span style="color: #F92672;">format</span><span style="color: #66D9EF;">(</span>city, response<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org20cc10e">
<h2 id="org20cc10e"><span class="section-number-2">4</span> More depth</h2>
<div class="outline-text-2" id="text-4">
</div>
</section>
<section id="slide-org00e91ae">
<h3 id="org00e91ae"><span class="section-number-3">4.1</span> Serialization: Many faces</h3>
<ul>
<li><code>send</code> and <code>recv</code> have corresponding <code>send_string</code> and <code>recv_string</code></li>
<li>There are others, like <code>send_json</code>, or <code>send_pyobj</code>, with corresponding <code>recv_json</code> and <code>recv_pyobj</code></li>
<li>Serializing functions can be used for customization</li>

</ul>

</section>
<section id="slide-orgb0cdd74">
<h3 id="orgb0cdd74"><span class="section-number-3">4.2</span> Pub Sub</h3>
<ul>
<li>Publisher sending updates to many Subscribers</li>
<li>Updates categorized</li>
<li>Subscriber can opt on specific updates</li>
<li>Publisher</li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">import</span> zmq
<span style="color: #F92672;">import</span> time
<span style="color: #F92672;">import</span> sys

<span style="color: #FD971F;">port</span> = <span style="color: #E6DB74;">"5556"</span>
<span style="color: #F92672;">if</span> <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>sys.argv<span style="color: #AE81FF;">)</span> &gt; <span style="color: #AE81FF;">1</span>:
    <span style="color: #FD971F;">port</span> =  sys.argv<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span>
    <span style="color: #F92672;">int</span><span style="color: #AE81FF;">(</span>port<span style="color: #AE81FF;">)</span>

<span style="color: #FD971F;">context</span> = zmq.Context<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">socket</span> = context.socket<span style="color: #AE81FF;">(</span>zmq.PUB<span style="color: #AE81FF;">)</span>
socket.bind<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"tcp://*:%s"</span> % port<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">topic</span> = <span style="color: #AE81FF;">0</span>
<span style="color: #F92672;">while</span> <span style="color: #AE81FF;">True</span>:
    <span style="color: #FD971F;">topic</span>, <span style="color: #FD971F;">now</span> = topic + <span style="color: #AE81FF;">1</span>, time.ctime<span style="color: #AE81FF;">()</span>
    socket.send_string<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"1 update {} {}"</span>.<span style="color: #F92672;">format</span><span style="color: #66D9EF;">(</span>topic, now<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
    socket.send_string<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"2 update {} {}"</span>.<span style="color: #F92672;">format</span><span style="color: #66D9EF;">(</span>topic, now<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
    time.sleep<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

</section>
<section >

<ul>
<li>Subscriber</li>

</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">import</span> sys
<span style="color: #F92672;">import</span> zmq

<span style="color: #FD971F;">context</span> = zmq.Context<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">sock</span> = context.socket<span style="color: #AE81FF;">(</span>zmq.SUB<span style="color: #AE81FF;">)</span>

<span style="color: #FD971F;">topic</span> = <span style="color: #E6DB74;">"1"</span>
<span style="color: #F92672;">if</span> <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>sys.argv<span style="color: #AE81FF;">)</span> &gt; <span style="color: #AE81FF;">1</span>:
    <span style="color: #FD971F;">topic</span> = sys.argv<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span>
sock.setsockopt_string<span style="color: #AE81FF;">(</span>zmq.SUBSCRIBE, topic<span style="color: #AE81FF;">)</span>
sock.connect<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"tcp://127.0.0.1:5556"</span><span style="color: #AE81FF;">)</span>

<span style="color: #F92672;">while</span> <span style="color: #AE81FF;">True</span>:
    <span style="color: #FD971F;">message</span> = sock.recv_string<span style="color: #AE81FF;">()</span>
    <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>message<span style="color: #AE81FF;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgca4fa58">
<h2 id="orgca4fa58"><span class="section-number-2">5</span> Second exercise: Getting temperature</h2>
<div class="outline-text-2" id="text-5">
</div>
</section>
<section id="slide-org4c0e1ca">
<h3 id="org4c0e1ca"><span class="section-number-3">5.1</span> Description</h3>
<ul>
<li>Build a temperature server publishing zip codes (9999 to 10005), with temperatures</li>
<li>Then add a subscriber subscribing to a zip code, and calculating the average temperature for the last 5 records</li>
<li>Try to make the client capable to connect to more than one server</li>

</ul>

</section>
<section id="slide-orgcfc1f32">
<h3 id="orgcfc1f32"><span class="section-number-3">5.2</span> Weather server</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">import</span> zmq
<span style="color: #F92672;">import</span> random
<span style="color: #F92672;">import</span> sys
<span style="color: #F92672;">import</span> time

<span style="color: #FD971F;">port</span> = <span style="color: #E6DB74;">"5556"</span>
<span style="color: #F92672;">if</span> <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>sys.argv<span style="color: #AE81FF;">)</span> &gt; <span style="color: #AE81FF;">1</span>:
    <span style="color: #FD971F;">port</span> =  sys.argv<span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span>
    <span style="color: #F92672;">int</span><span style="color: #AE81FF;">(</span>port<span style="color: #AE81FF;">)</span>

<span style="color: #FD971F;">context</span> = zmq.Context<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">socket</span> = context.socket<span style="color: #AE81FF;">(</span>zmq.PUB<span style="color: #AE81FF;">)</span>
socket.bind<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"tcp://*:%s"</span> % port<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">while</span> <span style="color: #AE81FF;">True</span>:
    <span style="color: #FD971F;">topic</span> = random.randrange<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">9999</span>,<span style="color: #AE81FF;">10005</span><span style="color: #AE81FF;">)</span>
    <span style="color: #FD971F;">messagedata</span> = random.randrange<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span>,<span style="color: #AE81FF;">215</span><span style="color: #AE81FF;">)</span> - <span style="color: #AE81FF;">80</span>
    socket.send_string<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"%d %d"</span> % <span style="color: #66D9EF;">(</span>topic, messagedata<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
    time.sleep<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

</section>
